item = ['쓰레기봉투료', '설렁탕', '냉면', '비빔밥', '갈비탕', '삼계탕', '김치찌개백반', '된장찌개백반', '불고기', '쇠고기(외식)', '돼지갈비(외식)', '삼겹살(외식)', '자장면', '짬뽕', '탕수육', '돈가스', '생선초밥', '치킨', '햄버거', '피자', '칼국수', '라면(외식)', '김밥', '커피(외식))', '국산차(외식)', '세탁료', '의복수선료', '택배이용료', '볼링장이용료', '골프연습장이용료', '당구장이용료', '노래방이용료', 'PC방이용료', '사진촬영료', '사진인화료', '숙박료(여관)', '이용료', '미용료', '목욕료', '찜질방이용료']

last_month = [620, 8400, 8000, 6800, 13200, 14600, 6500, 7000, 12200, 34600, 17000, 13180, 6000, 7900, 17800, 6800, 22125, 15740, 4240, 20800, 6900, 3700, 2500, 2000, 4280, 5900, 4200, 7000, 3900, 140000, 7500, 22000, 1240, 17600, 3600, 25000, 12400, 17000, 7700, 8700]

this_month = [620, 9625, 8600, 7500, 13200, 15400, 6600, 7000, 13000, 40400, 17000, 13102, 6000, 7900, 18000, 7800, 22125, 17660, 5280, 20800, 6900, 3575, 2760, 2000, 4280, 8800, 4200, 10000, 4000, 252500, 10600, 25600, 1240, 18200, 3600, 25000, 12400, 17000, 7700, 8700]

length = len(item)

for i in range(length):
    inflation_rate = ((this_month[i] / last_month[i]) - 1) * 100
    print(item[i], ":", inflation_rate)
